Repository: pypi-data/pypi-mirror-30
Catalog: packages/collective.contentexport/collective.contentexport-1.1.tar.gz/collective.contentexport-1.1/src/collective/contentexport/locales/*/LC_MESSAGES/collective.contentexport.po
Languages: de

source: Choose one
de: Wählen Sie eine Option

source: Comma Separated Values File
de: Komma getrennte CSV Datei

source: Content Type to export
de: Inhaltstyp der exportiert werden soll

source: Excel Legacy Spreadsheet (xls)
de: Alte Excel Datei (xls)

source: Excel Spreadsheet (xlsx)
de: Excel Datei (xlsx)

source: Export Type
de: Art des Exports

source: Export content in various formats.
de: Exportiert Inhalte in diversen Formaten

source: Export files as zip
de: Dateien als zip exportieren

source: Export images as zip
de: Bilder als zip exportieren

source: Export related files and images as zip
de: Verbundene Dateien und Bilder als zip exportieren

source: HTML Table
de: HTML Tabelle

source: Image and File Format
de: Format für Bilder und Dateien

source: Location within the a zip
de: Relativer Pfad innerhald einer zip-Datei

source: Reset
de: Zurücksetzen

source: Richtext Format
de: Format des Inhalts von Richtext-Feldern

source: Tab Separated Values File
de: Tab getrennte TSV-Datei
