Repository: pypi-data/pypi-mirror-30
Catalog: packages/mayan-edms-ng/mayan_edms_ng-3.0.1-py2-none-any.whl/mayan/apps/cabinets/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Cabinets
fr: Armoires

source: Remove from cabinets
fr: Retirer des armoires

source: Add to cabinets
fr: Ajouter aux armoires

source: Add new level
fr: Ajouter un nouveau niveau

source: Create cabinet
fr: Créer une armoire

source: Delete
fr: Supprimer

source: Edit
fr: Modifier

source: All
fr: Tout

source: Details
fr: Détails

source: Label
fr: Libellé

source: Cabinet
fr: Armoire

source: Parent and Label
fr: Parent et étiquette

source: %(model_name)s with this %(field_labels)s already exists.
fr: %(model_name)s avec ce %(field_labels)s existe déjà

source: Document cabinet
fr: Armoire de document

source: Document cabinets
fr: Armoires de document

source: Add documents to cabinets
fr: Ajouter des documents à l'armoire

source: Create cabinets
fr: Créer des armoires

source: Delete cabinets
fr: Supprimer des armoires

source: Edit cabinets
fr: Modifier des armoires

source: Remove documents from cabinets
fr: Supprimer des documents de l'armoire

source: View cabinets
fr: Visualiser les armoires

source: List of children cabinets.
fr: Liste des armoires enfants.

source: Number of documents on this cabinet level.
fr: Nombre de documents à ce niveau de l'armoire.

source: The name of this cabinet level appended to the names of its ancestors.
fr: Le nom de ce niveau d'armoire a été ajouté au nom de ses ancêtres.

source: URL of the API endpoint showing the list documents inside this cabinet.
fr: URL du point de terminaison de l'API montrant la liste des documents à l'intérieur de cette armoire.

source: Comma separated list of document primary keys to add to this cabinet.
fr: Liste séparée par des virgules des clés primaires du document à ajouter à cette armoire.

source: API URL pointing to a document in relation to the cabinet storing it. This URL is different than the canonical document URL.
fr: URL de l'API indiquant un document par rapport à l'armoire qui l'enregistre. Cette URL est différente de l'URL du document canonique.

source: Add new level to: %s
fr: Ajouter un nouveau niveau à: %s

source: Delete the cabinet: %s?
fr: Supprimer l'armoire: %s?

source: Details of cabinet: %s
fr: Détails de l'armoire: %s

source: Edit cabinet: %s
fr: Modifier l'armoire: %s

source: Cabinets containing document: %s
fr: Armoires contenant le document: %s

source: Add to cabinet request performed on %(count)d document
fr: Demande d'ajout à l'armoire effectuée sur %(count)d document

source: Add to cabinet request performed on %(count)d documents
fr: Demande d'ajout à l'armoire effectuée sur %(count)d documents

source: Add
fr: Ajouter

source: Add document "%s" to cabinets
fr: Ajouter le document "%s" à l'armoire

source: Cabinets to which the selected documents will be added.
fr: Armoires auxquels les documents sélectionnés seront ajoutés.

source: Document: %(document)s is already in cabinet: %(cabinet)s.
fr: Le document: %(document)s est déjà dans l'armoire: %(cabinet)s.

source: Document: %(document)s added to cabinet: %(cabinet)s successfully.
fr: Le document: %(document)s a été ajouté à l'armoire: %(cabinet)s avec succès.

source: Remove from cabinet request performed on %(count)d document
fr: Demande de suppression dans l'armoire effectuée sur %(count)d document

source: Remove from cabinet request performed on %(count)d documents
fr: Demande de suppression dans l'armoire effectuée sur %(count)d documents

source: Remove
fr: Supprimer

source: Cabinets from which the selected documents will be removed.
fr: Armoires à partir desquels les documents sélectionnés seront supprimés.

source: Document: %(document)s is not in cabinet: %(cabinet)s.
fr: Le document: %(document)s n'est pas dans l'armoire: %(cabinet)s.

source: Document: %(document)s removed from cabinet: %(cabinet)s.
fr: Le document: %(document)s a été supprimé de l'armoire: %(cabinet)s.
