Repository: pypi-data/pypi-mirror-30
Catalog: packages/mayan-edms-ng/mayan_edms_ng-3.0.2-py2-none-any.whl/mayan/apps/cabinets/locale/*/LC_MESSAGES/django.po
Languages: es

source: Cabinets
es: Archivadores

source: Remove from cabinets
es: Remover de archivador

source: Add to cabinets
es: Agregar a archivadores

source: Add new level
es: Agregar un nuevo nivel

source: Create cabinet
es: Crear archivador

source: Delete
es: Borrar

source: Edit
es: Editar

source: All
es: Todos

source: Details
es: Detalles

source: Label
es: Etiqueta

source: Documents
es: Documentos

source: Cabinet
es: Archivador

source: Parent and Label
es: Padre y etiqueta

source: %(model_name)s with this %(field_labels)s already exists.
es: %(model_name)s con este %(field_labels)s ya existe.

source: Document cabinet
es: Archivador de documento

source: Document cabinets
es: Archivadores de documento

source: Add documents to cabinets
es: Agregar documentos a archivadores

source: Create cabinets
es: Crear archivadores

source: Delete cabinets
es: Borrar archivadores

source: Edit cabinets
es: Editar archivadores

source: Remove documents from cabinets
es: Remover documentos de archivadores

source: View cabinets
es: Ver archivadores

source: List of children cabinets.
es: Lista de los gabinetes subsiguientes.

source: Number of documents on this cabinet level.
es: Número de documentos en este nivel de archivador.

source: The name of this cabinet level appended to the names of its ancestors.
es: El nombre de este nivel de archivador anejado a de los archivadores que lo contienen.

source: URL of the API endpoint showing the list documents inside this cabinet.
es: URL del servicio de la API que muetra los documentos contenidos en este archivador.

source: Comma separated list of document primary keys to add to this cabinet.
es: Lista separada por comas de llaves primarias de documentos para agregar a este archivador.

source: API URL pointing to a document in relation to the cabinet storing it. This URL is different than the canonical document URL.
es: URL de la API que apunta a un documento en relación con el gabinete que lo almacena. Esta URL es diferente de la URL del documento canónico.

source: Navigation:
es: Navegación:

source: Add new level to: %s
es: Agregar un nuevo nivel a: %s

source: Delete the cabinet: %s?
es: ¿Borrar archivador: %s?

source: Details of cabinet: %s
es: Detalles de archivador: %s

source: Edit cabinet: %s
es: Editar archivador: %s

source: Cabinets containing document: %s
es: Archivadores que contienen el documento: %s

source: Add to cabinet request performed on %(count)d document
es: Solicitud de añadir a gabinete realizada en %(count)d documento

source: Add to cabinet request performed on %(count)d documents
es: Solicitud de añadir a gabinete realizada en %(count)d documentos

source: Add
es: Agregar

source: Add document "%s" to cabinets
es: Agregar documento "%s" a archivadores

source: Cabinets to which the selected documents will be added.
es: Archivador a los cuales el documento seleccionado va a ser agregado.

source: Document: %(document)s is already in cabinet: %(cabinet)s.
es: Documento: %(document)s ya está en gabinete: %(cabinet)s.

source: Document: %(document)s added to cabinet: %(cabinet)s successfully.
es: Documento: %(document)s añadido al gabinete: %(cabinet)s correctamente.

source: Remove from cabinet request performed on %(count)d document
es: Solicitud de retirar del gabinete realizada en el documento %(count)d

source: Remove from cabinet request performed on %(count)d documents
es: Solicitud de retirar del gabinete realizada en el documento %(count)d

source: Remove
es: Eliminar

source: Cabinets from which the selected documents will be removed.
es: Gabinetes de los que se eliminarán los documentos seleccionados.

source: Document: %(document)s is not in cabinet: %(cabinet)s.
es: Documento: %(document)s no está en el gabinete: %(cabinet)s.

source: Document: %(document)s removed from cabinet: %(cabinet)s.
es: Documento: %(document)s retirado del gabinete: %(cabinet)s.
