import pytest


def test_cut():
    from oujago.nlp import seg

    t_sentences = ["这是一个伸手不见五指的黑夜。我叫孙悟空，我爱北京，我爱Python和C++。",
                   "我不喜欢日本和服", "雷猴回归人间", "雷猴是个好网站",
                   "工信处女干事每月经过下属科室都要亲口交代24口交换机等技术性器件的安装工作",
                   "我需要廉租房", "永和服装饰品有限公司", "我爱北京天安门", "abc", "隐马尔可夫",
                   "“Microsoft”一词由“MICROcomputer（微型计算机）”和“SOFTware（软件）”两部分组成",
                   "草泥马和欺实马是今年的流行词汇", "伊藤洋华堂总府店", "中国科学院计算技术研究所",
                   "罗密欧与朱丽叶  Hahaha", "新生小鼠中肌红蛋白含量较成年鼠高吗？",
                   "南京市长江大桥", '乒乓球拍卖完了',
                   '#火锅先生#看完这则新闻，首先要感谢这些年碰到的每一位服务员，对我的不杀之恩。',
                   '不过既然决定从事服务行业，就应该学会调整心态。就算顾客说话再难听，也不能采取偏激行为。',
                   '花钱还要受罪，换了谁都不愿意。最后提个醒，出门在外少骂娘少摆谱，很多人都是这么意外死亡的。',
                   '怀化什么时候能有自己的马拉松赛？_都市生活_怀化新闻网',
                   '你希望怀化有自己的马拉松赛吗？',
                   '谈谈你的看法2012厦门国际马拉松将于1月7日举行厦门国际马拉松赛创办于2003年，',
                   '由中国田径协会和厦门市政府联合主办，由中央电视台和厦门电视台联合直播，国内外40余家电视台转播。',
                   '经过几年的发展，厦门国际马拉松赛以其较高的竞赛水平、广泛的群众参与和丰富的配套活动，',
                   '成为中国最具影响力和国际知名度的马拉松赛事之一，2007年12月被国际田联评为“国际田联路跑金牌赛事”，',
                   '并连续三年获此殊荣。比赛时间：每年一月份的第一个星期六 。2012年比赛时间为1月7日（星期六）。',
                   '比赛项目：男、女：马拉松',
                   '乔治马丁写冰与火之歌拖了好久',
                   '国务院总理李克强调研上海外高桥时提出，支持上海积极探索新机制。']

    for t_sentence in t_sentences:
        print(seg(t_sentence))
        print(seg(t_sentence, HMM=False))
        print(seg(t_sentence, cut_all=True))
        print()

